# pascal-basic-interpreter

This project is unfinished, for now it can be used as a calculator.

## Build
`fpc -O2 MyLanguage.pas`

## Usage
```
$ ./MyLanguage
basic> 2 + 6 * 9
56
basic> 4 - (-2)
6
basic> 1.3 + 1.5
2.8
basic> exit
```
